<script lang="ts">
</script>

<title>Условия использовани</title>
<main>
	<div class="pic">
		<div class="head">
			<span style="text-shadow: 4px 2px 5px black; z-index: 2">УСЛОВИЯ ИСПОЛЬЗОВАНИЯ</span>
		</div>
		<picture style="display: flex">
			<source srcset="/src/assets/law.webp" media="(max-width: 1150px)" />
			<img style="filter: brightness(0.75)" class="img" src="/src/assets/lawBig.webp" alt="" />
		</picture>
	</div>
	<div class="content">
		<div class="text">
			<br />
			<h1>Условия использования интернет-магазина чая MisterTEA</h1>
			<h1 id="perData">Политика обработки персональных данных</h1>
			<h2>1. Общие положения</h2>
			<p>
				1.1. Настоящая Политика обработки персональных данных (далее — Политика) регулирует
				обработку и защиту персональных данных Пользователей интернет-магазина чая MisterTEA (далее
				— Сайт).
			</p>
			<p>
				1.2. Сайт соблюдает требования Федерального закона №152-ФЗ "О персональных данных" от 27
				июля 2006 года и других нормативных актов Российской Федерации, касающихся защиты
				персональных данных.
			</p>
			<h2>2. Определения</h2>
			<p>
				2.1. Персональные данные — информация, относящаяся к прямо или косвенно определенному или
				определяемому индивиду.
			</p>
			<p>
				2.2. Обработка персональных данных — любое действие (операция) или совокупность действий
				(операций), совершаемых с использованием средств автоматизации или без использования таких
				средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение,
				уточнение (обновление, изменение), извлечение, использование, передачу (распространение,
				предоставление, доступ), обезличивание, блокирование, удаление и уничтожение.
			</p>
			<h2>3. Сбор и обработка персональных данных</h2>
			<p>
				3.1. Сайт собирает и обрабатывает персональные данные Пользователей в соответствии с
				законодательством Российской Федерации.
			</p>
			<p>
				3.2. Персональные данные Пользователей собираются законным путем, путем добровольного
				предоставления Пользователем, получены от третьих лиц, уполномоченных представителей или в
				результате обследования.
			</p>
			<h2>4. Цели обработки персональных данных</h2>
			<p>
				4.1. Цель обработки персональных данных Пользователей — предоставление доступа к информации
				о товарах и услугах, размещенных на Сайте, а также возможность совершения покупок через
				интернет.
			</p>
			<h2>5. Права Пользователя</h2>
			<p>
				5.1. Пользователь имеет право на доступ к своим персональным данным, их исправление,
				удаление, а также на ограничение обработки своих персональных данных.
			</p>
			<p>
				5.2. Пользователь имеет право на получение информации о том, какие персональные данные о нем
				обрабатываются, их источник, назначение, дата и время обработки данных, а также на получение
				информации о субъектах, которым эти данные могут быть переданы.
			</p>
			<h2>6. Обеспечение безопасности персональных данных</h2>
			<p>
				6.1. Сайт принимает все необходимые меры для защиты персональных данных Пользователей от
				неправомерного доступа, их уничтожения, изменения, блокирования, копирования,
				предоставления, распространения, а также от иных неправомерных действий третьих лиц.
			</p>
			<h2>7. Изменение Политики</h2>
			<p>
				7.1. Владелец Сайта оставляет за собой право вносить изменения в настоящую Политику в любое
				время. Изменения вступают в силу после публикации на Сайте.
			</p>
			<h2>8. Контактная информация</h2>
			<p>
				8.1. Для связи с Владельцем Сайта используйте адрес электронной почты: <a
					style="color: black"
					href="mailto:parashchenko.fedor@gmail.com">parashchenko.fedor@gmail.com</a
				>
			</p>
			<h2>9. Принятие Политики</h2>
			<p>
				9.1. Пользователь, нажимая кнопку "Я принимаю условия Политики обработки персональных
				данных" при регистрации на Сайте, подтверждает свое согласие с условиями настоящей Политики.
			</p>
			<p>Дата последнего обновления: 30 апреля 2024 года</p>
			<br />
			<br />
			<h1 id="confPol">Политика конфиденциальности</h1>
			<h2>1. Общие положения</h2>
			<p>
				1.1. Настоящая Политика конфиденциальности (далее — Политика) регулирует обработку и защиту
				персональных данных Пользователей интернет-магазина чая MisterTEA (далее — Сайт).
			</p>
			<p>
				1.2. Сайт соблюдает требования Федерального закона №152-ФЗ "О персональных данных" от 27
				июля 2006 года и других нормативных актов Российской Федерации, касающихся защиты
				персональных данных.
			</p>
			<h2>2. Определения</h2>
			<p>
				2.1. Персональные данные — информация, относящаяся к прямо или косвенно определенному или
				определяемому индивиду.
			</p>
			<p>
				2.2. Обработка персональных данных — любое действие (операция) или совокупность действий
				(операций), совершаемых с использованием средств автоматизации или без использования таких
				средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение,
				уточнение (обновление, изменение), извлечение, использование, передачу (распространение,
				предоставление, доступ), обезличивание, блокирование, удаление и уничтожение.
			</p>
			<h2>3. Сбор и обработка персональных данных</h2>
			<p>
				3.1. Сайт собирает и обрабатывает персональные данные Пользователей в соответствии с
				законодательством Российской Федерации.
			</p>
			<p>
				3.2. Персональные данные Пользователей собираются законным путем, путем добровольного
				предоставления Пользователем, получены от третьих лиц, уполномоченных представителей или в
				результате обследования.
			</p>
			<h2>4. Цели обработки персональных данных</h2>
			<p>
				4.1. Цель обработки персональных данных Пользователей — предоставление доступа к информации
				о товарах и услугах, размещенных на Сайте, а также возможность совершения покупок через
				интернет.
			</p>
			<h2>5. Права Пользователя</h2>
			<p>
				5.1. Пользователь имеет право на доступ к своим персональным данным, их исправление,
				удаление, а также на ограничение обработки своих персональных данных.
			</p>
			<p>
				5.2. Пользователь имеет право на получение информации о том, какие персональные данные о нем
				обрабатываются, их источник, назначение, дата и время обработки данных, а также на получение
				информации о субъектах, которым эти данные могут быть переданы.
			</p>
			<h2>6. Обеспечение безопасности персональных данных</h2>
			<p>
				6.1. Сайт принимает все необходимые меры для защиты персональных данных Пользователей от
				неправомерного доступа, их уничтожения, изменения, блокирования, копирования,
				предоставления, распространения, а также от иных неправомерных действий третьих лиц.
			</p>
			<h2>7. Изменение Политики</h2>
			<p>
				7.1. Владелец Сайта оставляет за собой право вносить изменения в настоящую Политику в любое
				время. Изменения вступают в силу после публикации на Сайте.
			</p>
			<h2>8. Контактная информация</h2>
			<p>
				8.1. Для связи с Владельцем Сайта используйте адрес электронной почты: <a
					style="color: black"
					href="mailto:parashchenko.fedor@gmail.com">parashchenko.fedor@gmail.com</a
				>
			</p>
			<h2>9. Принятие Политики</h2>
			<p>
				9.1. Пользователь, нажимая кнопку "Я принимаю условия Политики конфиденциальности" при
				регистрации на Сайте, подтверждает свое согласие с условиями настоящей Политики.
			</p>
			<p>Дата последнего обновления: 30 апреля 2024 года</p>
			<br />
			<br />
			<h1 id="useTerms">Пользовательское соглашение</h1>
			<h2>1. Общие положения</h2>
			<p>
				1.1. Настоящее Пользовательское Соглашение (далее — Соглашение) регулирует отношения между
				владельцем интернет-магазина MisterTea (далее — Владелец) и пользователями сайта (далее —
				Пользователь).
			</p>
			<p>
				1.2. Пользователь, принимая условия настоящего Соглашения, подтверждает, что он достиг
				совершеннолетия и имеет полную дееспособность.
			</p>
			<p>
				1.3. Пользовательское Соглашение является публичной офертой. Принятие условий Соглашения
				Пользователем осуществляется путем регистрации на сайте и выбора опции "Я принимаю условия
				Соглашения".
			</p>
			<h2>2. Права и обязанности сторон</h2>
			<p>
				2.1. Владелец предоставляет Пользователю доступ к информации о товарах и услугах,
				размещенной на сайте, а также возможность совершения покупок через интернет.
			</p>
			<p>
				2.2. Пользователь обязуется использовать сайт в соответствии с законодательством и настоящим
				Соглашением, не нарушать права и законные интересы Владельца и других Пользователей.
			</p>
			<h2>3. Ограничения и ответственность</h2>
			<p>
				3.1. Пользователь самостоятельно несет ответственность за свои действия на сайте. Владелец
				не несет ответственности за действия Пользователя.
			</p>
			<p>
				3.2. Владелец не несет ответственности за вредоносные программы, распространяемые через
				сайт.
			</p>
			<h2>4. Условия оплаты и доставки</h2>
			<p>4.1. Условия оплаты и доставки товаров указаны в разделе "Оплата и доставка" на сайте.</p>
			<p>
				4.2. Владелец оставляет за собой право изменять условия оплаты и доставки в любое время без
				предварительного уведомления Пользователя.
			</p>
			<h2>5. Защита персональных данных</h2>
			<p>
				5.1. Владелец обязуется соблюдать законодательство о защите персональных данных
				Пользователей.
			</p>
			<p>
				5.2. Пользователь дает согласие на обработку своих персональных данных Владельцем для целей,
				указанных в Соглашении.
			</p>
			<h2>6. Изменение Соглашения</h2>
			<p>
				6.1. Владелец имеет право вносить изменения в настоящее Соглашение в любое время. Изменения
				вступают в силу после публикации на сайте.
			</p>
			<p>6.2. Пользователь обязан регулярно проверять актуальность Соглашения на сайте.</p>
			<h2>7. Заключительные положения</h2>
			<p>
				7.1. Настоящее Соглашение является единственным и обязательным договором между Владельцем и
				Пользователем.
			</p>
			<p>
				7.2. В случае возникновения споров между сторонами, применяется законодательство Российской
				Федерации.
			</p>
			<p>
				7.3. Владелец имеет право в любое время прекратить предоставление услуг Пользователю без
				предварительного уведомления.
			</p>
			<h2>8. Контактная информация</h2>
			<p>
				8.1. Для связи с Владельцем используйте адрес электронной почты: <a
					style="color: black"
					href="mailto:parashchenko.fedor@gmail.com">parashchenko.fedor@gmail.com</a
				>
			</p>
			<p>
				8.2. Владелец не несет ответственности за невозможность доступа к сайту или его содержимому
				в случае технических неисправностей или обслуживания сайта.
			</p>
			<h2>9. Принятие Соглашения</h2>
			<p>
				9.1. Пользователь, прочитав настоящее Соглашение, подтверждает, что он полностью его
				понимает и принимает все его условия.
			</p>
			<p>
				9.2. Пользователь, нажимая кнопку "Я принимаю условия Соглашения" при регистрации на сайте,
				подтверждает свое согласие с условиями настоящего Соглашения.
			</p>
			<p>Дата последнего обновления: 30 апреля 2024 года</p>
		</div>
	</div>
</main>

<style lang="scss">
	.pic {
		display: flex;
		justify-content: center;
		align-items: center;
		position: relative;
	}

	.img {
		width: 100%;
		height: 100%;
	}

	.content {
		padding-left: 80px;
		padding-right: 80px;
		padding-bottom: 110px;
		margin: 0;
		background-color: #f3e7bc;
	}

	.text {
		font-family:
			Noto Sans,
			sans-serif;
		font-weight: 400;
		font-size: 30px;
		line-height: 150%;
		color: #000;
	}

	h1 {
		font-family: 'Prosto One', sans-serif;
		font-size: 50px;
		text-transform: uppercase;
		color: #1e1e1e;
		margin-top: 0;
		padding-top: 90px;
		margin-bottom: 36px;
	}

	h2 {
		@extend h1;
		font-size: 40px;
		padding-top: 40px;
	}

	.head {
		position: absolute;

		display: flex;
		justify-content: center;
		align-items: center;
		text-align: center;

		font-family: 'Prosto One', sans-serif;
		font-weight: 400;
		font-size: 98px;
		color: white;
	}

	@media (max-width: 1150px) {
		.head {
			font-size: 6.8vw;
		}
		.content {
			padding-left: 60px;
			padding-right: 60px;
		}
	}

	@media (max-width: 900px) {
		.content {
			padding-left: 30px;
			padding-right: 30px;
			padding-bottom: 95px;
		}

		.text {
			font-size: 17px;
		}

		h1 {
			font-size: 21px;
			padding-top: 60px;
		}

		h2 {
			padding-top: 20px;
			font-size: 19px;
		}
	}

	@media (max-width: 700px) {
		.content {
			padding-left: 30px;
			padding-right: 30px;
			padding-bottom: 95px;
		}

		.text {
			font-size: 16px;
		}

		h1 {
			font-size: 20px;
			padding-top: 60px;
		}

		h2 {
			padding-top: 20px;
			font-size: 18px;
		}
	}

	@media (max-width: 400px) {
		.content {
			padding-left: 20px;
			padding-right: 20px;
			padding-bottom: 80px;
		}

		.text {
			font-size: 13px;
		}

		h1 {
			font-size: 15px;
			padding-top: 45px;
		}

		h2 {
			font-size: 14px;
		}
	}

	@media (max-width: 300px) {
		.content {
			padding-left: 10px;
			padding-right: 10px;
			padding-bottom: 70px;
		}
	}
</style>
